tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/turbulent/1_Inlet_2_Outlet/porosityBased/BP/losses-massConstr/0/pa
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pa;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontBack
    {
        type            empty;
    }

    designWall  
    {
        type            zeroGradient;
    }

    IEntranceWall  
    {
        type            zeroGradient;
    }

    OEntranceWall  
    {
        type            zeroGradient;
    }

    OREntranceWall  
    {
        type            zeroGradient;
    }

    inlet  
    {
        type            zeroGradient;
    }

    outlet
    {
        type            adjointOutletPressure;
        value           uniform 0.0;
    }
    
    outlet-right
    {
        type            adjointOutletPressure;
        value           uniform 0.0;
    }
}

// ************************************************************************* //
